---
kind: type
id: T:Autodesk.Revit.DB.Visual.ConcreteBrightmodeType
source: html/b118fa59-6c6b-a292-a5f2-441776a0ad39.htm
---
# Autodesk.Revit.DB.Visual.ConcreteBrightmodeType

The enumerated type representing the permitted values for the asset property "ConcreteBrightmode" from the "Concrete" schema.

## Syntax (C#)
```csharp
public enum ConcreteBrightmodeType
```